bubble/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    faceGrabbed;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.06 -1 -0.0001) (0.0625 1 0.0001);
        }
    }
    {
        name    faceGrabbed;
        type    faceSet;
        action  add;
        source  boxToFace;
        sourceInfo
        {
            box (0.1375 -1 -0.0001) (0.1400 1 0.0001);
        }
    }
);


// ************************************************************************* //
